{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 22], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "batch_normalization_91", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_91", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "conv1d_37", "class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_91", 0, 0, {}]]]}, {"name": "batch_normalization_92", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_92", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"name": "activation_79", "class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_92", 0, 0, {}]]]}, {"name": "conv1d_38", "class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_79", 0, 0, {}]]]}, {"name": "batch_normalization_93", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_93", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"name": "activation_80", "class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_93", 0, 0, {}]]]}, {"name": "conv1d_39", "class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_80", 0, 0, {}]]]}, {"name": "batch_normalization_94", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_94", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"name": "activation_81", "class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_94", 0, 0, {}]]]}, {"name": "conv1d_40", "class_name": "Conv1D", "config": {"name": "conv1d_40", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_81", 0, 0, {}]]]}, {"name": "batch_normalization_95", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_95", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]]}, {"name": "activation_82", "class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]]}, {"name": "conv1d_41", "class_name": "Conv1D", "config": {"name": "conv1d_41", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_82", 0, 0, {}]]]}, {"name": "batch_normalization_96", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_96", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]]}, {"name": "activation_83", "class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_96", 0, 0, {}]]]}, {"name": "conv1d_42", "class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "filters": 5, "kernel_size": [6], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_83", 0, 0, {}]]]}, {"name": "batch_normalization_97", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_97", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_42", 0, 0, {}]]]}, {"name": "activation_84", "class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]]}, {"name": "generate_pairwise_f_14", "class_name": "generatePairwiseF", "config": {"name": "generate_pairwise_f_14", "trainable": true}, "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 18], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["generate_pairwise_f_14", 0, 0, {}], ["input_14", 0, 0, {}]]]}, {"name": "batch_normalization_98", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_98", "trainable": true, "axis": 2, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "conv2d_43", "class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]]}, {"name": "batch_normalization_99", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_99", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_43", 0, 0, {}]]]}, {"name": "activation_85", "class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]]}, {"name": "conv2d_44", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_85", 0, 0, {}]]]}, {"name": "batch_normalization_100", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_100", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"name": "activation_86", "class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]]}, {"name": "conv2d_45", "class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_86", 0, 0, {}]]]}, {"name": "batch_normalization_101", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_101", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"name": "activation_87", "class_name": "Activation", "config": {"name": "activation_87", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]]}, {"name": "conv2d_46", "class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_87", 0, 0, {}]]]}, {"name": "batch_normalization_102", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_102", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}, {"name": "activation_88", "class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]]}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"name": "batch_normalization_103", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"name": "activation_89", "class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]]}, {"name": "conv2d_48", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "filters": 5, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_89", 0, 0, {}]]]}, {"name": "batch_normalization_104", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}, {"name": "activation_90", "class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]]}, {"name": "conv2d_49", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "filters": 1, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_90", 0, 0, {}]]]}, {"name": "activation_91", "class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"name": "flatten_7", "class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["activation_91", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0]], "output_layers": [["flatten_7", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}